espressif/arduino-esp32/boards.txt
ticos-kit-orange.menu.FlashSize.4M=4MB (32Mb)
ticos-kit-orange.menu.FlashSize.4M.build.flash_size=4MB
ticos-kit-orange.menu.FlashSize.8M=8MB (64Mb)
ticos-kit-orange.menu.FlashSize.8M.build.flash_size=8MB
ticos-kit-orange.menu.FlashSize.8M.build.partitions=default_8MB
ticos-kit-orange.menu.FlashSize.2M=2MB (16Mb)
ticos-kit-orange.menu.FlashSize.2M.build.flash_size=2MB
ticos-kit-orange.menu.FlashSize.2M.build.partitions=minimal
ticos-kit-orange.menu.FlashSize.16M=16MB (128Mb)
ticos-kit-orange.menu.FlashSize.16M.build.flash_size=16MB

ticos-kit-orange.menu.UploadSpeed.921600=921600
ticos-kit-orange.menu.UploadSpeed.921600.upload.speed=921600
ticos-kit-orange.menu.UploadSpeed.115200=115200
ticos-kit-orange.menu.UploadSpeed.115200.upload.speed=115200
ticos-kit-orange.menu.UploadSpeed.256000.windows=256000
ticos-kit-orange.menu.UploadSpeed.256000.upload.speed=256000
ticos-kit-orange.menu.UploadSpeed.230400.windows.upload.speed=256000
ticos-kit-orange.menu.UploadSpeed.230400=230400
ticos-kit-orange.menu.UploadSpeed.230400.upload.speed=230400
ticos-kit-orange.menu.UploadSpeed.460800.linux=460800
ticos-kit-orange.menu.UploadSpeed.460800.macosx=460800
ticos-kit-orange.menu.UploadSpeed.460800.upload.speed=460800
ticos-kit-orange.menu.UploadSpeed.512000.windows=512000
ticos-kit-orange.menu.UploadSpeed.512000.upload.speed=512000

ticos-kit-orange.menu.DebugLevel.none=None
ticos-kit-orange.menu.DebugLevel.none.build.code_debug=0
ticos-kit-orange.menu.DebugLevel.error=Error
ticos-kit-orange.menu.DebugLevel.error.build.code_debug=1
ticos-kit-orange.menu.DebugLevel.warn=Warn
ticos-kit-orange.menu.DebugLevel.warn.build.code_debug=2
ticos-kit-orange.menu.DebugLevel.info=Info
ticos-kit-orange.menu.DebugLevel.info.build.code_debug=3
ticos-kit-orange.menu.DebugLevel.debug=Debug
ticos-kit-orange.menu.DebugLevel.debug.build.code_debug=4
ticos-kit-orange.menu.DebugLevel.verbose=Verbose
ticos-kit-orange.menu.DebugLevel.verbose.build.code_debug=5
##############################################################
